# Erase Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
PlanTopologySet..::..Erase Method
PlanTopologySet Class See Also
---
Removes a specified object from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	PlanTopology item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As PlanTopology _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	PlanTopology^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..PlanTopologyThe item to be erased.
# ### Return Value
The number of items that were erased from the set.
# See Also
PlanTopologySet Class
Autodesk.Revit.DB Namespace